// 산술 연산자 ( + , - , * , / , %)
// + : 왼쪽 피연산자 값에 오른쪽 피연산자의 값을 더함
// - : 왼쪽 피연산자 값에 오른쪽 피연산자의 값을 뺌
// * : 왼쪽 피연산자 값에 오른쪽 피연산자의 값을 곱함
// / : 왼쪽 피연산자 값에 오른쪽 피연산자의 값을 나눔
// % : 왼쪽 피연산자 값에 오른쪽 피연산자의 값을 나눈 후, 나머지 반환

// 1. 더하기 연산자 (+)
console.log(1 + 1); // 2
console.log(1 + "1"); // 11

// 2. 빼기 연산자 (-)
console.log(1 - "2"); // -1
console.log(1 - 2); // -1

// 3. 곱하기 연산자 (*)
console.log(2 * 3); // 6
console.log(2 * "3"); // 6

// 4. 나누기 연산자 (/)
console.log(4 / 2); // 2
console.log(4 / "2"); // 2

// 5. 나누기 연산자(/)
console.log(5 / 2); // 2.5

// 6. 나머지 연산자(%)
console.log(5 % 2); // 1