// 대입 연산자 ( =, +=, -=, *=, /=, %=)
// + : 왼쪽 피연산자 값에 오른쪽 피연산자의 값을 대입함
// - : 왼쪽 피연산자 값에 오른쪽 피연산자의 값을 더한 후, 결과값을 왼쪽 피연산자에 대입함
// * : 왼쪽 피연산자 값에 오른쪽 피연산자의 값을 곱한 후, 결과값을 왼쪽 피연산자에 대입함
// / : 왼쪽 피연산자 값에 오른쪽 피연산자의 값을 나눈 후, 결과값을 왼쪽 피연산자에 대입함
// % : 왼쪽 피연산자 값에 오른쪽 피연산자의 값을 나눈 후, 그 나머지를 후, 결과값을 왼쪽 피연산자에 대입함

// 1. 더하기 등호 연산자(+=)
let x1 = 10;
x1 += 10;
console.log(x1); // 20

// 2. 빼기 등호 연산자(-=)
let x2 = 15;
x2 -= 5;
console.log(x2); // 5

// 3. 곱하기 등호 연산자(*=)
let x3 = 10;
x3 *= 2;
console.log(x3); // 20

// 4. 나누기 등호 연산자(/=)
let x4 = 10;
x4 /= 2;
console.log(x4); // 5

// 5. 나누기 등호 연산자(/=)
let x5 = 10;
x5 %= 2;
console.log(x5); // 0

