/*
## Class 
자바스크립트 기반이 아닌 다른 언어에서는 대게 클래스 기반의 프로그래밍 개발기법(생성자,상속 등..)을 사용함
개발자들이 자바스크립트로 넘어와서 자꾸 클래스 '처럼' 개발하려 노력하다보니 JS사이드에서도 그 니즈를 반영함

### 클래스와 인스턴스의 일반적 개념
우리의 일상 생활에서 비유하자면 공장으로 예시를 들 수 있다.
공장에서 '상품'을 다량으로 생산해내기 위해서 '설계도'를 만드며 그 설계도 토대로 각 특징이 있는 '상품'을 찍어냄

#### 클래스(Class)
학교에서 다양한 종류의 책상을 만드는 설계도와 비슷함. 
이 설계도를 보면 어떤 종류의 책상을 만들 수 있는지, 책상이 가지고 있는 특징(이 특징은 변수-또는 속성과 메서드)은 무엇인지 알 수 있음.
즉 객체를 생성하기 위한 설계도이다.

#### 인스턴스(Instance)
설계도를 보고 만들어진 **실제 책상**이라고 생각해볼 수 있음. 
책상의 모양, 크기, 색상, 재료 등은 모두 설계도에 따라 만들어지며, 이러한 책상들은 모두 다른 인스턴스가 된다.
이렇게 클래스는 객체를 만들기 위한 설계도라고 생각할 수 있고, 이 설계도를 바탕으로 만들어진 실제 객체들은 인스턴스라고 할 수 있다.
*/
